{"0001140361-24-040659": {"sections": [{"content": " Item 7.01 Regulation FD Disclosure.\n\nOn August 30, 2016, the European Commission (the “Commission”) announced its decision that Ireland granted state aid to Apple Inc. (the “Company”) by providing tax opinions in 1991 and 2007 concerning the tax allocation of profits of the Irish branches of two subsidiaries of the Company (the “State Aid Decision”). The State Aid Decision ordered Ireland to calculate and recover additional taxes from the Company for the period June 2003 through December 2014. Irish legislative changes, effective as of January 2015, eliminated the application of the tax opinions from that date forward. The Company and Ireland appealed the State Aid Decision to the General Court of the Court of Justice of the European Union (the “General Court”). On July 15, 2020, the General Court annulled the State Aid Decision. On September 25, 2020, the Commission appealed the General Court’s decision to the European Court of Justice (the “ECJ”) and a hearing was held on May 23, 2023.\n\n \n\nOn September 10, 2024, the ECJ announced that it had set aside the 2020 judgment of the General Court and confirmed the Commission’s 2016 State Aid Decision. As a result, the Company expects to record a one-time income tax charge in its fourth fiscal quarter ending September 28, 2024, of up to approximately $10 billion, which will increase the Company’s effective tax rate for the quarter.\n\n \n\nThe information presented in this Current Report is preliminary and actual results may differ when the Company reports its final results for the fourth quarter.\n\n \n\nThe information contained in this Current Report shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing.\n\n \n\nThis Current Report contains forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include without limitation those about the Company’s anticipated effective tax rate and financial results. These statements involve risks and uncertainties, and actual results may differ materially from any future results expressed or implied by the forward-looking statements. Risks and uncertainties include without limitation: effects of global and regional economic conditions, including as a result of government policies, war, terrorism, natural disasters, and public health issues; risks relating to the design, manufacture, introduction, and transition of products and services in highly competitive and rapidly changing markets, including from reliance on third parties for components, technology, manufacturing, applications, and content; risks relating to information technology system failures, network disruptions, and failure to protect, loss of, or unauthorized access to, or release of, data; and effects of unfavorable legal proceedings, government investigations, and complex and changing laws and regulations. More information on these risks and other potential factors that could affect the Company’s business, reputation, results of operations, financial condition, and stock price is included in the Company’s filings with the SEC, including in the “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” sections of the Company’s most recently filed periodic reports on Form 10-K and Form 10-Q and subsequent filings. The Company assumes no obligation to update any forward-looking statements, which speak only as of the date they are made.\n\n", "id": "0001140361-24-040659_RegulationFDDisclosure", "section_name": "RegulationFDDisclosure"}], "exhibits": []}, "0000320193-24-000120": {"sections": [{"content": " Item 2.02 Results of Operations and Financial Condition. \n\nOn October 31, 2024, Apple Inc. (“Apple”) issued a press release regarding Apple’s financial results for its fourth fiscal quarter ended September 28, 2024. A copy of Apple’s press release is attached hereto as Exhibit 99.1. \n\nThe information contained in this Current Report shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing. \n\n  \n\n", "id": "0000320193-24-000120_ResultsofOperationsandFinancialCondition", "section_name": "ResultsofOperationsandFinancialCondition"}, {"content": " Item 9.01 Financial Statements and Exhibits. \n\n(d) Exhibits. \n\nExhibit Number Exhibit Description 99.1 \n\nPress release issued by Apple Inc. on October 31, 2024. \n\n104 Inline XBRL for the cover page of this Current Report on Form 8-K. \n\n", "id": "0000320193-24-000120_FinancialStatementsandExhibits", "section_name": "FinancialStatementsandExhibits"}], "exhibits": [{"content": "Exhibit 99.1 Apple reports fourth quarter results iPhone drives record September quarter revenue Services revenue reaches new all-time high CUPERTINO, CALIFORNIA — Apple® today announced financial results for its fiscal 2024 fourth quarter ended September 28, 2024. The Company posted quarterly revenue of $94.9 billion, up 6 percent year over year, and quarterly diluted earnings per share of $0.97. Diluted earnings per share was $1.64,1 up 12 percent year over year when excluding the one-time charge recognized during the fourth quarter of 2024 related to the impact of the reversal of the European General Court’s State Aid decision. “Today Apple is reporting a new September quarter revenue record of $94.9 billion, up 6 percent from a year ago,” said Tim Cook, Apple’s CEO. “During the quarter, we were excited to announce our best products yet, with the all-new iPhone 16 lineup, Apple Watch Series 10, AirPods 4, and remarkable features for hearing health and sleep apnea detection. And this week, we released our first set of features for Apple Intelligence, which sets a new standard for privacy in AI and supercharges our lineup heading into the holiday season.” “Our record business performance during the September quarter drove nearly $27 billion in operating cash flow, allowing us to return over $29 billion to our shareholders,” said Luca Maestri, Apple’s CFO. “We are very pleased that our active installed base of devices reached a new all-time high across all products and all geographic segments, thanks to our high levels of customer satisfaction and loyalty.” Apple’s board of directors has declared a cash dividend of $0.25 per share of the Company’s common stock. The dividend is payable on November 14, 2024 to shareholders of record as of the close of business on November 11, 2024. Apple will provide live streaming of its Q4 2024 financial results conference call beginning at 2:00 p.m. PT on October 31, 2024 at apple.com/investor/earnings-call. The webcast will be available for replay for approximately two weeks thereafter. 1. Non-GAAP measure. See the section titled “Reconciliation of Non-GAAP to GAAP Results of Operations” at the end of the accompanying financial statements. Apple periodically provides information for investors on its corporate website, apple.com, and its investor relations website, investor.apple.com. This includes press releases and other information about financial performance, reports filed or furnished with the SEC, information on corporate governance, and details related to its annual meeting of shareholders. This press release contains forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include without limitation those about payment of the Company’s quarterly dividend and future business plans. These statements involve risks and uncertainties, and actual results may differ materially from any future results expressed or implied by the forward-looking statements. Risks and uncertainties include without limitation: effects of global and regional economic conditions, including as a result of government policies, geopolitical tensions, conflict, terrorism, natural disasters, and public health issues; risks relating to the design, manufacture, introduction, and transition of products and services in highly competitive and rapidly changing markets, including from reliance on third parties for components, technology, manufacturing, applications, support, and content; risks relating to information technology system failures, network disruptions, and failure to protect, loss of, or unauthorized access to, or release of, data; and effects of unfavorable legal proceedings, government investigations, and complex and changing laws and regulations. More information on these risks and other potential factors that could affect the Company’s business, reputation, results of operations, financial condition, and stock price is included in the Company’s filings with the SEC, including in the “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” sections of the Company’s most recently filed periodic reports on Form 10-K and Form 10-Q and subsequent filings. The Company assumes no obligation to update any forward-looking statements, which speak only as of the date they are made. Apple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, AirPods, Apple Watch, and Apple Vision Pro. Apple’s six software platforms — iOS, iPadOS, macOS, watchOS, visionOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, iCloud, and Apple TV+. Apple’s more than 150,000 employees are dedicated to making the best products on earth and to leaving the world better than we found it. Press Contact: Josh Rosenstock Apple jrosenstock@apple.com (408) 862-1142 Investor Relations Contact: Suhasini Chandramouli Apple suhasini@apple.com (408) 974-3123 NOTE TO EDITORS: For additional information visit Apple Newsroom (www.apple.com/newsroom), or email Apple’s Media Helpline at media.help@apple.com. © 2024 Apple Inc. All rights reserved. Apple and the Apple logo are trademarks of Apple. Other company and product names may be trademarks of their respective owners. Apple Inc. CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (Unaudited) (In millions, except number of shares, which are reflected in thousands, and per-share amounts) Three Months Ended Twelve Months Ended September 28, September 30, September 28, September 30, 2024 2023 2024 2023 Net sales: Products $ 69,958 $ 67,184 $ 294,866 $ 298,085 Services 24,972 22,314 96,169 85,200 Total net sales (1) 94,930 89,498 391,035 383,285 Cost of sales: Products 44,566 42,586 185,233 189,282 Services 6,485 6,485 25,119 24,855 Total cost of sales 51,051 49,071 210,352 214,137 Gross margin 43,879 40,427 180,683 169,148 Operating expenses: Research and development 7,765 7,307 31,370 29,915 Selling, general and administrative 6,523 6,151 26,097 24,932 Total operating expenses 14,288 13,458 57,467 54,847 Operating income 29,591 26,969 123,216 114,301 Other income/(expense), net 19 29 269 (565) Income before provision for income taxes 29,610 26,998 123,485 113,736 Provision for income taxes 14,874 4,042 29,749 16,741 Net income $ 14,736 $ 22,956 $ 93,736 $ 96,995 Earnings per share: Basic $ 0.97 $ 1.47 $ 6.11 $ 6.16 Diluted $ 0.97 $ 1.46 $ 6.08 $ 6.13 Shares used in computing earnings per share: Basic 15,171,990 15,599,434 15,343,783 15,744,231 Diluted 15,242,853 15,672,400 15,408,095 15,812,547 (1) Net sales by reportable segment: Americas $ 41,664 $ 40,115 $ 167,045 $ 162,560 Europe 24,924 22,463 101,328 94,294 Greater China 15,033 15,084 66,952 72,559 Japan 5,926 5,505 25,052 24,257 Rest of Asia Pacific 7,383 6,331 30,658 29,615 Total net sales $ 94,930 $ 89,498 $ 391,035 $ 383,285 (1) Net sales by category: iPhone $ 46,222 $ 43,805 $ 201,183 $ 200,583 Mac 7,744 7,614 29,984 29,357 iPad 6,950 6,443 26,694 28,300 Wearables, Home and Accessories 9,042 9,322 37,005 39,845 Services 24,972 22,314 96,169 85,200 Total net sales $ 94,930 $ 89,498 $ 391,035 $ 383,285 Apple Inc. CONDENSED CONSOLIDATED BALANCE SHEETS (Unaudited) (In millions, except number of shares, which are reflected in thousands, and par value) September 28, September 30, 2024 2023 ASSETS: Current assets: Cash and cash equivalents $ 29,943 $ 29,965 Marketable securities 35,228 31,590 Accounts receivable, net 33,410 29,508 Vendor non-trade receivables 32,833 31,477 Inventories 7,286 6,331 Other current assets 14,287 14,695 Total current assets 152,987 143,566 Non-current assets: Marketable securities 91,479 100,544 Property, plant and equipment, net 45,680 43,715 Other non-current assets 74,834 64,758 Total non-current assets 211,993 209,017 Total assets $ 364,980 $ 352,583 LIABILITIES AND SHAREHOLDERS’ EQUITY: Current liabilities: Accounts payable $ 68,960 $ 62,611 Other current liabilities 78,304 58,829 Deferred revenue 8,249 8,061 Commercial paper 9,967 5,985 Term debt 10,912 9,822 Total current liabilities 176,392 145,308 Non-current liabilities: Term debt 85,750 95,281 Other non-current liabilities 45,888 49,848 Total non-current liabilities 131,638 145,129 Total liabilities 308,030 290,437 Commitments and contingencies Shareholders’ equity: Common stock and additional paid-in capital, $0.00001 par value: 50,400,000 shares authorized; 15,116,786 and 15,550,061 shares issued and outstanding, respectively 83,276 73,812 Accumulated deficit (19,154) (214) Accumulated other comprehensive loss (7,172) (11,452) Total shareholders’ equity 56,950 62,146 Total liabilities and shareholders’ equity $ 364,980 $ 352,583 Apple Inc. CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (Unaudited) (In millions) Twelve Months Ended September 28, September 30, 2024 2023 Cash, cash equivalents, and restricted cash and cash equivalents, beginning balances $ 30,737 $ 24,977 Operating activities: Net income 93,736 96,995 Adjustments to reconcile net income to cash generated by operating activities: Depreciation and amortization 11,445 11,519 Share-based compensation expense 11,688 10,833 Other (2,266) (2,227) Changes in operating assets and liabilities: Accounts receivable, net (3,788) (1,688) Vendor non-trade receivables (1,356) 1,271 Inventories (1,046) (1,618) Other current and non-current assets (11,731) (5,684) Accounts payable 6,020 (1,889) Other current and non-current liabilities 15,552 3,031 Cash generated by operating activities 118,254 110,543 Investing activities: Purchases of marketable securities (48,656) (29,513) Proceeds from maturities of marketable securities 51,211 39,686 Proceeds from sales of marketable securities 11,135 5,828 Payments for acquisition of property, plant and equipment (9,447) (10,959) Other (1,308) (1,337) Cash generated by investing activities 2,935 3,705 Financing activities: Payments for taxes related to net share settlement of equity awards (5,441) (5,431) Payments for dividends and dividend equivalents (15,234) (15,025) Repurchases of common stock (94,949) (77,550) Proceeds from issuance of term debt, net — 5,228 Repayments of term debt (9,958) (11,151) Proceeds from/(Repayments of) commercial paper, net 3,960 (3,978) Other (361) (581) Cash used in financing activities (121,983) (108,488) Increase/(Decrease) in cash, cash equivalents, and restricted cash and cash equivalents (794) 5,760 Cash, cash equivalents, and restricted cash and cash equivalents, ending balances $ 29,943 $ 30,737 Supplemental cash flow disclosure: Cash paid for income taxes, net $ 26,102 $ 18,679 Apple Inc. RECONCILIATION OF NON-GAAP TO GAAP RESULTS OF OPERATIONS (Unaudited) (In millions, except number of shares, which are reflected in thousands, and per-share amounts) Three Months Ended Twelve Months Ended September 28, 2024 September 28, 2024 As Reported (GAAP) Non-GAAP Adjustments (a) As Adjusted (Non-GAAP) As Reported (GAAP) Non-GAAP Adjustments (a) As Adjusted (Non-GAAP) Income before provision for income taxes $ 29,610 $ — $ 29,610 $ 123,485 $ — $ 123,485 Provision for income taxes 14,874 (10,246) (b) 4,628 29,749 (10,246) (b) 19,503 Net income $ 14,736 $ 10,246 (b) $ 24,982 $ 93,736 $ 10,246 (b) $ 103,982 Diluted earnings per share $ 0.97 $ 0.67 (c) $ 1.64 $ 6.08 $ 0.67 (c) $ 6.75 Shares used in computing diluted earnings per share 15,242,853 — 15,242,853 15,408,095 — 15,408,095 (a)These adjustments reconcile certain of the Company’s GAAP results of operations to its non-GAAP results of operations. The Company believes that the presentation of results excluding the impact of the reversal of the European General Court’s State Aid decision provides meaningful supplemental information to both management and investors that is indicative of the Company’s core operating results and facilitates comparison of operating results across reporting periods. The Company uses these non-GAAP measures when evaluating its financial results as well as for internal planning and forecasting purposes. These non-GAAP measures should not be viewed as a substitute for the Company’s GAAP results. (b)Non-GAAP adjustments to provision for income taxes and net income to reflect the impact of the reversal of the European General Court’s State Aid decision recognized during the fourth quarter of 2024. On September 10, 2024, the European Court of Justice announced that it had set aside the 2020 judgment of the European General Court and confirmed the European Commission’s 2016 State Aid decision. As a result, during the fourth quarter of 2024 the Company recorded a one-time income tax charge of $10.2 billion, net, which represents $15.8 billion payable to Ireland via release of restricted funds held in escrow, partially offset by a U.S. foreign tax credit of $4.8 billion and a decrease in unrecognized tax benefits of $823 million. For additional information, refer to Note 7, “Income Taxes” of the Notes to Consolidated Financial Statements that will be included in Part II, Item 8 of the Company's fiscal 2024 Annual Report on Form 10-K. (c)Represents the per-share impact of the non-GAAP adjustments to net income.", "id": "0000320193-24-000120_EX-EX-99.1", "exhibit_number": "EX-99.1"}]}, "0001140361-25-000228": {"sections": [{"content": " Item 5.02 Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. \n\nAs part of Apple Inc.’s (“Apple’s”) previously announced Chief Financial Officer transition plan, Apple’s Board of Directors appointed Kevan Parekh, 53, as Apple’s Senior Vice President, Chief Financial Officer, effective January 1, 2025. Mr. Parekh succeeds Luca Maestri in the role of CFO. Mr. Parekh joined Apple in June 2013 and assumed his current position in January 2025. Mr. Parekh’s previous positions at Apple include Vice President, Financial Planning and Analysis and Vice President, Finance for Sales, Marketing, and Retail. Prior to joining Apple, Mr. Parekh held various senior leadership roles at Thomson Reuters and General Motors. Mr. Parekh’s annual salary was increased to $1 million, effective January 1, 2025, and he is eligible to participate in the Apple Inc. Executive Cash Incentive Plan for fiscal year 2025 on the same basis as Apple’s other named executive officers, with a target opportunity of 175% of base salary based on his time in his respective roles for fiscal year 2025. Mr. Parekh was previously awarded 36,767 performance-based restricted stock units (“RSUs”), and 36,767 time-based RSUs for fiscal year 2025 under the Apple Inc. 2022 Employee Stock Plan. The performance-based RSUs are scheduled to vest on October 1, 2027, subject to the terms of the award agreement. Between 0% and 200% of the target number of performance-based RSUs may vest, with the percentage determined based on Apple’s total shareholder return relative to companies in the S&P 500 from September 29, 2024 through September 25, 2027. The time-based RSUs are scheduled to vest in equal installments on each of April 1, 2027, April 1, 2028, and April 1, 2029, subject to the terms of the award agreement. Apple and Mr. Parekh have entered into Apple’s standard indemnification agreement for executive officers. There are no family relationships between Mr. Parekh and any director or executive officer of Apple that would be required to be disclosed pursuant to Item 401(d) of Regulation S-K, and there are no transactions between Mr. Parekh and Apple that would be required to be disclosed pursuant to Item 404(a) of Regulation S-K. \n\n", "id": "0001140361-25-000228_DepartureofDirectorsorCertainOfficers;ElectionofDirectors;AppointmentofCertainOfficers:CompensatoryArrangementsofCertainOfficers", "section_name": "DepartureofDirectorsorCertainOfficers;ElectionofDirectors;AppointmentofCertainOfficers:CompensatoryArrangementsofCertainOfficers"}], "exhibits": []}, "0000320193-25-000007": {"sections": [{"content": " Item 2.02 Results of Operations and Financial Condition. \n\nOn January 30, 2025, Apple Inc. (“Apple”) issued a press release regarding Apple’s financial results for its first fiscal quarter ended December 28, 2024. A copy of Apple’s press release is attached hereto as Exhibit 99.1. \n\nThe information contained in this Current Report shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing. \n\n  \n\n", "id": "0000320193-25-000007_ResultsofOperationsandFinancialCondition", "section_name": "ResultsofOperationsandFinancialCondition"}, {"content": " Item 9.01 Financial Statements and Exhibits. \n\n(d) Exhibits. \n\nExhibit Number Exhibit Description 99.1 \n\nPress release issued by Apple Inc. on January 30, 2025. \n\n104 Inline XBRL for the cover page of this Current Report on Form 8-K. \n\n", "id": "0000320193-25-000007_FinancialStatementsandExhibits", "section_name": "FinancialStatementsandExhibits"}], "exhibits": [{"content": "Exhibit 99.1 Apple reports first quarter results All-time records for total company revenue and EPS Services revenue reaches new all-time high CUPERTINO, CALIFORNIA — Apple® today announced financial results for its fiscal 2025 first quarter ended December 28, 2024. The Company posted quarterly revenue of $124.3 billion, up 4 percent year over year, and quarterly diluted earnings per share of $2.40, up 10 percent year over year. “Today Apple is reporting our best quarter ever, with revenue of $124.3 billion, up 4 percent from a year ago,” said Tim Cook, Apple’s CEO. “We were thrilled to bring customers our best-ever lineup of products and services during the holiday season. Through the power of Apple silicon, we’re unlocking new possibilities for our users with Apple Intelligence, which makes apps and experiences even better and more personal. And we’re excited that Apple Intelligence will be available in even more languages this April.” “Our record revenue and strong operating margins drove EPS to a new all-time record with double-digit growth and allowed us to return over $30 billion to shareholders,” said Kevan Parekh, Apple’s CFO. “We are also pleased that our installed base of active devices has reached a new all-time high across all products and geographic segments.” Apple’s board of directors has declared a cash dividend of $0.25 per share of the Company’s common stock. The dividend is payable on February 13, 2025, to shareholders of record as of the close of business on February 10, 2025. Apple will provide live streaming of its Q1 2025 financial results conference call beginning at 2:00 p.m. PT on January 30, 2025 at apple.com/investor/earnings-call. The webcast will be available for replay for approximately two weeks thereafter. Apple periodically provides information for investors on its corporate website, apple.com, and its investor relations website, investor.apple.com. This includes press releases and other information about financial performance, reports filed or furnished with the SEC, information on corporate governance, and details related to its annual meeting of shareholders. This press release contains forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include without limitation those about payment of the Company’s quarterly dividend and future business plans. These statements involve risks and uncertainties, and actual results may differ materially from any future results expressed or implied by the forward-looking statements. Risks and uncertainties include without limitation: effects of global and regional economic conditions, including as a result of government policies, geopolitical tensions, conflict, terrorism, natural disasters, and public health issues; risks relating to the design, manufacture, introduction, and transition of products and services in highly competitive and rapidly changing markets, including from reliance on third parties for components, technology, manufacturing, applications, support, and content; risks relating to information technology system failures, network disruptions, and failure to protect, loss of, or unauthorized access to, or release of, data; and effects of unfavorable legal proceedings, government investigations, and complex and changing laws and regulations. More information on these risks and other potential factors that could affect the Company’s business, reputation, results of operations, financial condition, and stock price is included in the Company’s filings with the SEC, including in the “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” sections of the Company’s most recently filed periodic reports on Form 10-K and Form 10-Q and subsequent filings. The Company assumes no obligation to update any forward-looking statements, which speak only as of the date they are made. Apple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, AirPods, Apple Watch, and Apple Vision Pro. Apple’s six software platforms — iOS, iPadOS, macOS, watchOS, visionOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, iCloud, and Apple TV+. Apple’s more than 150,000 employees are dedicated to making the best products on earth and to leaving the world better than we found it. Press Contact: Josh Rosenstock Apple jrosenstock@apple.com (408) 862-1142 Investor Relations Contact: Suhasini Chandramouli Apple suhasini@apple.com (408) 974-3123 NOTE TO EDITORS: For additional information visit Apple Newsroom (www.apple.com/newsroom), or email Apple’s Media Helpline at media.help@apple.com. © 2025 Apple Inc. All rights reserved. Apple and the Apple logo are trademarks of Apple. Other company and product names may be trademarks of their respective owners. Apple Inc. CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (Unaudited) (In millions, except number of shares, which are reflected in thousands, and per-share amounts) Three Months Ended December 28, December 30, 2024 2023 Net sales: Products $ 97,960 $ 96,458 Services 26,340 23,117 Total net sales (1) 124,300 119,575 Cost of sales: Products 59,447 58,440 Services 6,578 6,280 Total cost of sales 66,025 64,720 Gross margin 58,275 54,855 Operating expenses: Research and development 8,268 7,696 Selling, general and administrative 7,175 6,786 Total operating expenses 15,443 14,482 Operating income 42,832 40,373 Other income/(expense), net (248) (50) Income before provision for income taxes 42,584 40,323 Provision for income taxes 6,254 6,407 Net income $ 36,330 $ 33,916 Earnings per share: Basic $ 2.41 $ 2.19 Diluted $ 2.40 $ 2.18 Shares used in computing earnings per share: Basic 15,081,724 15,509,763 Diluted 15,150,865 15,576,641 (1) Net sales by reportable segment: Americas $ 52,648 $ 50,430 Europe 33,861 30,397 Greater China 18,513 20,819 Japan 8,987 7,767 Rest of Asia Pacific 10,291 10,162 Total net sales $ 124,300 $ 119,575 (1) Net sales by category: iPhone $ 69,138 $ 69,702 Mac 8,987 7,780 iPad 8,088 7,023 Wearables, Home and Accessories 11,747 11,953 Services 26,340 23,117 Total net sales $ 124,300 $ 119,575 Apple Inc. CONDENSED CONSOLIDATED BALANCE SHEETS (Unaudited) (In millions, except number of shares, which are reflected in thousands, and par value) December 28, September 28, 2024 2024 ASSETS: Current assets: Cash and cash equivalents $ 30,299 $ 29,943 Marketable securities 23,476 35,228 Accounts receivable, net 29,639 33,410 Vendor non-trade receivables 29,667 32,833 Inventories 6,911 7,286 Other current assets 13,248 14,287 Total current assets 133,240 152,987 Non-current assets: Marketable securities 87,593 91,479 Property, plant and equipment, net 46,069 45,680 Other non-current assets 77,183 74,834 Total non-current assets 210,845 211,993 Total assets $ 344,085 $ 364,980 LIABILITIES AND SHAREHOLDERS’ EQUITY: Current liabilities: Accounts payable $ 61,910 $ 68,960 Other current liabilities 61,151 78,304 Deferred revenue 8,461 8,249 Commercial paper 1,995 9,967 Term debt 10,848 10,912 Total current liabilities 144,365 176,392 Non-current liabilities: Term debt 83,956 85,750 Other non-current liabilities 49,006 45,888 Total non-current liabilities 132,962 131,638 Total liabilities 277,327 308,030 Commitments and contingencies Shareholders’ equity: Common stock and additional paid-in capital, $0.00001 par value: 50,400,000 shares authorized; 15,040,731 and 15,116,786 shares issued and outstanding, respectively 84,768 83,276 Accumulated deficit (11,221) (19,154) Accumulated other comprehensive loss (6,789) (7,172) Total shareholders’ equity 66,758 56,950 Total liabilities and shareholders’ equity $ 344,085 $ 364,980 Apple Inc. CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (Unaudited) (In millions) Three Months Ended December 28, December 30, 2024 2023 Cash, cash equivalents, and restricted cash and cash equivalents, beginning balances $ 29,943 $ 30,737 Operating activities: Net income 36,330 33,916 Adjustments to reconcile net income to cash generated by operating activities: Depreciation and amortization 3,080 2,848 Share-based compensation expense 3,286 2,997 Other (2,009) (989) Changes in operating assets and liabilities: Accounts receivable, net 3,597 6,555 Vendor non-trade receivables 3,166 4,569 Inventories 215 (137) Other current and non-current assets 939 (1,457) Accounts payable (6,671) (4,542) Other current and non-current liabilities (11,998) (3,865) Cash generated by operating activities 29,935 39,895 Investing activities: Purchases of marketable securities (6,124) (9,780) Proceeds from maturities of marketable securities 15,967 13,046 Proceeds from sales of marketable securities 3,492 1,337 Payments for acquisition of property, plant and equipment (2,940) (2,392) Other (603) (284) Cash generated by investing activities 9,792 1,927 Financing activities: Payments for taxes related to net share settlement of equity awards (2,921) (2,591) Payments for dividends and dividend equivalents (3,856) (3,825) Repurchases of common stock (23,606) (20,139) Repayments of term debt (1,009) — Repayments of commercial paper, net (7,944) (3,984) Other (35) (46) Cash used in financing activities (39,371) (30,585) Increase in cash, cash equivalents, and restricted cash and cash equivalents 356 11,237 Cash, cash equivalents, and restricted cash and cash equivalents, ending balances $ 30,299 $ 41,974 Supplemental cash flow disclosure: Cash paid for income taxes, net $ 18,651 $ 7,255", "id": "0000320193-25-000007_EX-EX-99.1", "exhibit_number": "EX-99.1"}]}, "0000320193-25-000055": {"sections": [{"content": " Item 2.02 Results of Operations and Financial Condition. \n\nOn May 1, 2025, Apple Inc. (“Apple”) issued a press release regarding Apple’s financial results for its second fiscal quarter ended March 29, 2025. A copy of Apple’s press release is attached hereto as Exhibit 99.1. \n\nThe information contained in this Current Report shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing. \n\n  \n\n", "id": "0000320193-25-000055_ResultsofOperationsandFinancialCondition", "section_name": "ResultsofOperationsandFinancialCondition"}, {"content": " Item 9.01 Financial Statements and Exhibits. \n\n(d) Exhibits. \n\nExhibit Number Exhibit Description 99.1 \n\nPress release issued by Apple Inc. on May 1, 2025. \n\n104 Inline XBRL for the cover page of this Current Report on Form 8-K. \n\n", "id": "0000320193-25-000055_FinancialStatementsandExhibits", "section_name": "FinancialStatementsandExhibits"}], "exhibits": [{"content": "Exhibit 99.1 Apple reports second quarter results Services revenue reaches new all-time high EPS sets March quarter record CUPERTINO, CALIFORNIA — Apple® today announced financial results for its fiscal 2025 second quarter ended March 29, 2025. The Company posted quarterly revenue of $95.4 billion, up 5 percent year over year, and quarterly diluted earnings per share of $1.65, up 8 percent year over year. “Today Apple is reporting strong quarterly results, including double-digit growth in Services,” said Tim Cook, Apple’s CEO. “We were happy to welcome iPhone 16e to our lineup, and to introduce powerful new Macs and iPads that take advantage of the extraordinary capabilities of Apple silicon. And we were proud to announce that we’ve cut our carbon emissions by 60 percent over the past decade.” “Our March quarter business performance drove EPS growth of 8 percent and $24 billion in operating cash flow, allowing us to return $29 billion to shareholders,” said Kevan Parekh, Apple’s CFO. “And thanks to our high levels of customer loyalty and satisfaction, our installed base of active devices once again reached a new all-time high across all product categories and geographic segments.” Apple’s board of directors has declared a cash dividend of $0.26 per share of the Company’s common stock, an increase of 4 percent. The dividend is payable on May 15, 2025 to shareholders of record as of the close of business on May 12, 2025. The board of directors has also authorized an additional program to repurchase up to $100 billion of the Company’s common stock. Apple will provide live streaming of its Q2 2025 financial results conference call beginning at 2:00 p.m. PT on May 1, 2025 at apple.com/investor/earnings-call. The webcast will be available for replay for approximately two weeks thereafter. Apple periodically provides information for investors on its corporate website, apple.com, and its investor relations website, investor.apple.com. This includes press releases and other information about financial performance, reports filed or furnished with the SEC, information on corporate governance, and details related to its annual meeting of shareholders. This press release contains forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include without limitation those about the Company’s plan for return of capital, payment of its quarterly dividend, and future business plans. These statements involve risks and uncertainties, and actual results may differ materially from any future results expressed or implied by the forward-looking statements. Risks and uncertainties include without limitation: effects of global and regional economic conditions, including as a result of government policies, trade and other international disputes, geopolitical tensions, conflict, terrorism, natural disasters, and public health issues; risks relating to the design, manufacture, introduction, and transition of products and services in highly competitive and rapidly changing markets, including from reliance on third parties for components, technology, manufacturing, applications, support, and content; risks relating to information technology system failures, network disruptions, and failure to protect, loss of, or unauthorized access to, or release of, data; and effects of unfavorable legal proceedings, government investigations, and complex and changing laws and regulations. More information on these risks and other potential factors that could affect the Company’s business, reputation, results of operations, financial condition, and stock price is included in the Company’s filings with the SEC, including in the “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” sections of the Company’s most recently filed periodic reports on Form 10-K and Form 10-Q and subsequent filings. The Company assumes no obligation to update any forward-looking statements, which speak only as of the date they are made. Apple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, AirPods, Apple Watch, and Apple Vision Pro. Apple’s six software platforms — iOS, iPadOS, macOS, watchOS, visionOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, iCloud, and Apple TV+. Apple’s more than 150,000 employees are dedicated to making the best products on earth and to leaving the world better than we found it. Press Contact: Josh Rosenstock Apple jrosenstock@apple.com (408) 862-1142 Investor Relations Contact: Suhasini Chandramouli Apple suhasini@apple.com (408) 974-3123 NOTE TO EDITORS: For additional information visit Apple Newsroom (www.apple.com/newsroom), or email Apple’s Media Helpline at media.help@apple.com. © 2025 Apple Inc. All rights reserved. Apple and the Apple logo are trademarks of Apple. Other company and product names may be trademarks of their respective owners. Apple Inc. CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (Unaudited) (In millions, except number of shares, which are reflected in thousands, and per-share amounts) Three Months Ended Six Months Ended March 29, March 30, March 29, March 30, 2025 2024 2025 2024 Net sales: Products $ 68,714 $ 66,886 $ 166,674 $ 163,344 Services 26,645 23,867 52,985 46,984 Total net sales (1) 95,359 90,753 219,659 210,328 Cost of sales: Products 44,030 42,424 103,477 100,864 Services 6,462 6,058 13,040 12,338 Total cost of sales 50,492 48,482 116,517 113,202 Gross margin 44,867 42,271 103,142 97,126 Operating expenses: Research and development 8,550 7,903 16,818 15,599 Selling, general and administrative 6,728 6,468 13,903 13,254 Total operating expenses 15,278 14,371 30,721 28,853 Operating income 29,589 27,900 72,421 68,273 Other income/(expense), net (279) 158 (527) 108 Income before provision for income taxes 29,310 28,058 71,894 68,381 Provision for income taxes 4,530 4,422 10,784 10,829 Net income $ 24,780 $ 23,636 $ 61,110 $ 57,552 Earnings per share: Basic $ 1.65 $ 1.53 $ 4.06 $ 3.72 Diluted $ 1.65 $ 1.53 $ 4.05 $ 3.71 Shares used in computing earnings per share: Basic 14,994,082 15,405,856 15,037,903 15,457,810 Diluted 15,056,133 15,464,709 15,103,499 15,520,675 (1) Net sales by reportable segment: Americas $ 40,315 $ 37,273 $ 92,963 $ 87,703 Europe 24,454 24,123 58,315 54,520 Greater China 16,002 16,372 34,515 37,191 Japan 7,298 6,262 16,285 14,029 Rest of Asia Pacific 7,290 6,723 17,581 16,885 Total net sales $ 95,359 $ 90,753 $ 219,659 $ 210,328 (1) Net sales by category: iPhone $ 46,841 $ 45,963 $ 115,979 $ 115,665 Mac 7,949 7,451 16,936 15,231 iPad 6,402 5,559 14,490 12,582 Wearables, Home and Accessories 7,522 7,913 19,269 19,866 Services 26,645 23,867 52,985 46,984 Total net sales $ 95,359 $ 90,753 $ 219,659 $ 210,328 Apple Inc. CONDENSED CONSOLIDATED BALANCE SHEETS (Unaudited) (In millions, except number of shares, which are reflected in thousands, and par value) March 29, September 28, 2025 2024 ASSETS: Current assets: Cash and cash equivalents $ 28,162 $ 29,943 Marketable securities 20,336 35,228 Accounts receivable, net 26,136 33,410 Vendor non-trade receivables 23,662 32,833 Inventories 6,269 7,286 Other current assets 14,109 14,287 Total current assets 118,674 152,987 Non-current assets: Marketable securities 84,424 91,479 Property, plant and equipment, net 46,876 45,680 Other non-current assets 81,259 74,834 Total non-current assets 212,559 211,993 Total assets $ 331,233 $ 364,980 LIABILITIES AND SHAREHOLDERS’ EQUITY: Current liabilities: Accounts payable $ 54,126 $ 68,960 Other current liabilities 61,849 78,304 Deferred revenue 8,976 8,249 Commercial paper 5,982 9,967 Term debt 13,638 10,912 Total current liabilities 144,571 176,392 Non-current liabilities: Term debt 78,566 85,750 Other non-current liabilities 41,300 45,888 Total non-current liabilities 119,866 131,638 Total liabilities 264,437 308,030 Commitments and contingencies Shareholders’ equity: Common stock and additional paid-in capital, $0.00001 par value: 50,400,000 shares authorized; 14,939,315 and 15,116,786 shares issued and outstanding, respectively 88,711 83,276 Accumulated deficit (15,552) (19,154) Accumulated other comprehensive loss (6,363) (7,172) Total shareholders’ equity 66,796 56,950 Total liabilities and shareholders’ equity $ 331,233 $ 364,980 Apple Inc. CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (Unaudited) (In millions) Six Months Ended March 29, March 30, 2025 2024 Cash, cash equivalents, and restricted cash and cash equivalents, beginning balances $ 29,943 $ 30,737 Operating activities: Net income 61,110 57,552 Adjustments to reconcile net income to cash generated by operating activities: Depreciation and amortization 5,741 5,684 Share-based compensation expense 6,512 5,961 Other (2,217) (1,971) Changes in operating assets and liabilities: Accounts receivable, net 7,266 7,727 Vendor non-trade receivables 9,171 12,164 Inventories 858 53 Other current and non-current assets (4,371) (4,438) Accounts payable (14,604) (16,710) Other current and non-current liabilities (15,579) (3,437) Cash generated by operating activities 53,887 62,585 Investing activities: Purchases of marketable securities (12,442) (25,042) Proceeds from maturities of marketable securities 26,587 27,462 Proceeds from sales of marketable securities 5,210 4,314 Payments for acquisition of property, plant and equipment (6,011) (4,388) Other (635) (729) Cash generated by investing activities 12,709 1,617 Financing activities: Payments for taxes related to net share settlement of equity awards (3,205) (2,875) Payments for dividends and dividend equivalents (7,614) (7,535) Repurchases of common stock (49,504) (43,344) Repayments of term debt (4,009) (3,150) Repayments of commercial paper, net (3,968) (3,982) Other (77) (132) Cash used in financing activities (68,377) (61,018) Increase/(Decrease) in cash, cash equivalents, and restricted cash and cash equivalents (1,781) 3,184 Cash, cash equivalents, and restricted cash and cash equivalents, ending balances $ 28,162 $ 33,921 Supplemental cash flow disclosure: Cash paid for income taxes, net $ 31,683 $ 14,531", "id": "0000320193-25-000055_EX-EX-99.1", "exhibit_number": "EX-99.1"}]}, "0001140361-25-018400": {"sections": [{"content": " Item 8.01\n\nOther Events.\n\n \n\nOn May 12, 2025, Apple Inc. (“Apple”) consummated the issuance and sale of $1,500,000,000 aggregate principal amount of its 4.000% Notes due 2028 (the “2028 Notes”), $1,000,000,000 aggregate principal amount of its 4.200% Notes due 2030 (the “2030 Notes”), $1,000,000,000 aggregate principal amount of its 4.500% Notes due 2032 (the “2032 Notes”) and $1,000,000,000 aggregate principal amount of its 4.750% Notes due 2035 (the “2035 Notes” and, together with the 2028 Notes, the 2030 Notes, and the 2032 Notes, the “Notes”), pursuant to an underwriting agreement (the “Underwriting Agreement”) dated May 5, 2025 among Apple and Goldman Sachs & Co. LLC, Barclays Capital Inc., BofA Securities, Inc. and J.P. Morgan Securities LLC, as representatives of the several underwriters named therein.\n\n \n\nThe Notes are being issued pursuant to an indenture, dated as of November 1, 2024 (the “Indenture”), between Apple and The Bank of New York Mellon Trust Company, N.A., as trustee, together with the officer’s certificate, dated May 12, 2025 (the “Officer’s Certificate”), issued pursuant to the Indenture establishing the terms of each series of Notes.\n\n \n\nThe Notes are being issued pursuant to Apple’s Registration Statement on Form S-3 filed with the Securities and Exchange Commission and dated November 1, 2024 (Reg. No. 333-282937) (the “Registration Statement”).\n\n \n\nInterest on the 2028 Notes, the 2030 Notes, the 2032 Notes, and the 2035 Notes will be paid semi-annually in arrears on May 12 and November 12 of each year, beginning on November 12 , 2025 . \n\n \n\nThe 2028 Notes will mature on May 12, 2028 .   The 2030 Notes will mature on May 12, 2030 .   The 2032 Notes will mature on May 12, 2032. The 2035 Notes will mature on May 12, 2035 .  \n\n \n\nThe Notes will be Apple’s senior unsecured obligations and will rank equally with Apple’s other unsecured and unsubordinated debt from time to time outstanding.\n\n \n\nThe foregoing description of the Notes and related agreements is qualified in its entirety by the terms of the Underwriting Agreement, the Indenture and the Officer’s Certificate (including the forms of the Notes). Apple is furnishing the Underwriting Agreement and the Officer’s Certificate (including the forms of the Notes) attached hereto as Exhibits 1.1 and 4.1 through 4.5, respectively, and they are incorporated herein by reference. The Indenture is filed as Exhibit 4.1 to the Registration Statement. An opinion regarding the legality of the Notes is filed as Exhibit 5.1, and is incorporated by reference into the Registration Statement; and a consent relating to the incorporation of such opinion is incorporated by reference into the Registration Statement and is filed as Exhibit 23.1 by reference to its inclusion within Exhibit 5.1.\n\n", "id": "0001140361-25-018400_OtherEvents", "section_name": "OtherEvents"}, {"content": " Item 9.01 \n\nFinancial Statements and Exhibits.\n\n \n\n(d) Exhibits.\n\n \n\nExhibit\n\nNumber\n\n  Exhibit Description\n\n    1.1\n\n  Underwriting Agreement, dated May 5, 2025, among Apple Inc. and Goldman Sachs & Co. LLC, Barclays Capital Inc., BofA Securities, Inc. and J.P. Morgan Securities LLC, as representatives of the several underwriters named therein \n\n4.1\n\n  Officer’s Certificate of Apple Inc., dated May 12, 2025 \n\n4.2\n\n  Form of Global Note representing the 2028 Notes (included in Exhibit 4.1) \n\n4.3\n\n  Form of Global Note representing the 2030 Notes (included in Exhibit 4.1) \n\n4.4\n\n  Form of Global Note representing the 2032 Notes (included in Exhibit 4.1) \n\n4.5\n\n  Form of Global Note representing the 2035 Notes (included in Exhibit 4.1) \n\n5.1\n\n  Opinion of Latham & Watkins LLP \n\n23.1\n\n  Consent of Latham & Watkins LLP (included in the opinion filed as Exhibit 5.1) \n\n  Inline XBRL for the cover page of this Current Report on Form 8‐K\n\n", "id": "0001140361-25-018400_FinancialStatementsandExhibits", "section_name": "FinancialStatementsandExhibits"}], "exhibits": []}, "0001140361-25-025275": {"sections": [{"content": " Item 5.02 \n\nDeparture of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers.\n\n \n\nOn July 8, 2025, Apple Inc. (“Apple”) announced that Jeff Williams will transition his role as Chief Operating Officer later this month to Sabih Khan, Apple’s Senior Vice President of Operations, as part of a long-planned succession. Mr. Williams will continue reporting to Apple CEO Tim Cook and overseeing Apple’s world-class design team and Apple Watch alongside the company's Health initiatives. Apple’s design team will then transition to reporting directly to Mr. Cook after Mr. Williams retires late in the year.\n\n \n\n", "id": "0001140361-25-025275_DepartureofDirectorsorCertainOfficers;ElectionofDirectors;AppointmentofCertainOfficers:CompensatoryArrangementsofCertainOfficers", "section_name": "DepartureofDirectorsorCertainOfficers;ElectionofDirectors;AppointmentofCertainOfficers:CompensatoryArrangementsofCertainOfficers"}], "exhibits": []}, "0001140361-25-005876": {"sections": [{"content": " Item 5.07 Submission of Matters to a Vote of Security Holders.\n\nThe 2025 Annual Meeting of Shareholders (the “Annual Meeting”) of Apple Inc. (“Apple”) was held on   February 25, 2025. At the Annual Meeting, Apple’s shareholders voted on the following seven proposals and cast their votes as described below.\n\n1. The individuals listed below were elected at the Annual Meeting to serve as directors of Apple until the next annual meeting of shareholders and until their successors are duly elected and qualified:\n\n    For\n\n  Against\n\n  Abstained\n\n  Broker Non-Vote\n\nWanda Austin\n\n  9,072,076,816\n\n  40,131,307\n\n  29,197,385\n\n  3,038,264,304\n\nTim Cook\n\n  8,970,310,928\n\n  153,141,693\n\n  17,952,887\n\n  3,038,264,304\n\nAlex Gorsky\n\n  8,946,626,018\n\n  165,324,875\n\n  29,454,615\n\n  3,038,264,304\n\nAndrea Jung\n\n  8,546,796,776\n\n  565,487,160\n\n  29,121,572\n\n  3,038,264,304\n\nArt Levinson\n\n  8,479,896,928\n\n  633,590,301\n\n  27,918,279\n\n  3,038,264,304\n\nMonica Lozano\n\n  9,024,832,308\n\n  87,408,524\n\n  29,164,676\n\n  3,038,264,304\n\nRon Sugar\n\n  8,632,486,843\n\n  478,710,182\n\n  30,208,483\n\n  3,038,264,304\n\nSue Wagner\n\n  8,744,107,302\n\n  368,677,410\n\n  28,620,796\n\n  3,038,264,304\n\n2. A management proposal to ratify the appointment of Ernst & Young LLP as Apple’s independent registered public accounting firm for fiscal year 2025 was approved.\n\nFor\n\n  Against\n\n  Abstained\n\n11,910,666,249\n\n  221,074,424\n\n  47,929,139\n\n3. An advisory resolution to approve executive compensation was approved.\n\nFor\n\n  Against\n\n  Abstained\n\n  Broker Non-Vote\n\n8,397,138,183\n\n  691,312,529\n\n  52,954,796\n\n  3,038,264,304\n\n4. A shareholder proposal entitled “Report on Ethical AI Data Acquisition and Usage” was not approved.\n\nFor\n\n  Against\n\n  Abstained\n\n  Broker Non-Vote\n\n1,041,899,819\n\n  7,963,197,675\n\n  136,308,014\n\n  3,038,264,304\n\n5. A shareholder proposal entitled “Report on Costs and Benefits of Child Sex Abuse Material-Identifying Software & User Privacy” was not approved.\n\nFor\n\n  Against\n\n  Abstained\n\n  Broker Non-Vote\n\n802,117,145\n\n  8,198,486,901\n\n  140,801,462\n\n  3,038,264,304\n\n6. A shareholder proposal entitled “Request to Cease DEI Efforts” was not approved.\n\nFor\n\n  Against\n\n  Abstained\n\n  Broker Non-Vote\n\n210,451,697\n\n  8,843,175,086\n\n  87,778,725\n\n  3,038,264,304\n\n7. A shareholder proposal entitled “Report on Charitable Giving” was not approved.\n\nFor\n\n  Against\n\n  Abstained\n\n  Broker Non-Vote\n\n169,119,141\n\n  8,884,470,350\n\n  87,816,017\n\n  3,038,264,304\n\n", "id": "0001140361-25-005876_SubmissionofMatterstoaVoteofSecurityHolders", "section_name": "SubmissionofMatterstoaVoteofSecurityHolders"}], "exhibits": []}, "0001140361-25-027340": {"sections": [{"content": " Item 5.02 \n\nDeparture of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers.\n\n \n\nAs part of Apple Inc.’s (“Apple’s”) previously announced Chief Operating Officer transition plan, Apple’s Board of Directors appointed Sabih Khan, 58, as Apple’s Chief Operating Officer, effective July 25, 2025. Mr. Khan succeeds Jeff Williams in the role of COO.\n\nMr. Khan joined Apple in August 1995 and assumed his current position in July 2025. Mr. Khan’s previous positions at Apple include Senior Vice President, Operations and Vice President, Product Operations.\n\nApple and Mr. Khan have entered into Apple’s standard indemnification agreement for executive officers. There are no family relationships between Mr. Khan and any director or executive officer of Apple that would be required to be disclosed pursuant to Item 401(d) of Regulation S-K, and there are no transactions between Mr. Khan and Apple that would be required to be disclosed pursuant to Item 404(a) of Regulation S-K.\n\n \n\n", "id": "0001140361-25-027340_DepartureofDirectorsorCertainOfficers;ElectionofDirectors;AppointmentofCertainOfficers:CompensatoryArrangementsofCertainOfficers", "section_name": "DepartureofDirectorsorCertainOfficers;ElectionofDirectors;AppointmentofCertainOfficers:CompensatoryArrangementsofCertainOfficers"}], "exhibits": []}, "0000320193-25-000071": {"sections": [{"content": " Item 2.02 Results of Operations and Financial Condition. \n\nOn July 31, 2025, Apple Inc. (“Apple”) issued a press release regarding Apple’s financial results for its third fiscal quarter ended June 28, 2025. A copy of Apple’s press release is attached hereto as Exhibit 99.1. \n\nThe information contained in this Current Report shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing. \n\n  \n\n", "id": "0000320193-25-000071_ResultsofOperationsandFinancialCondition", "section_name": "ResultsofOperationsandFinancialCondition"}, {"content": " Item 9.01 Financial Statements and Exhibits. \n\n(d) Exhibits. \n\nExhibit Number Exhibit Description 99.1 \n\nPress release issued by Apple Inc. on July 31, 2025. \n\n104 Inline XBRL for the cover page of this Current Report on Form 8-K. \n\n", "id": "0000320193-25-000071_FinancialStatementsandExhibits", "section_name": "FinancialStatementsandExhibits"}], "exhibits": [{"content": "Exhibit 99.1 Apple reports third quarter results June quarter records for total company revenue, iPhone revenue and EPS Services revenue reaches new all-time high CUPERTINO, CALIFORNIA — Apple® today announced financial results for its fiscal 2025 third quarter ended June 28, 2025. The Company posted quarterly revenue of $94.0 billion, up 10 percent year over year, and quarterly diluted earnings per share of $1.57, up 12 percent year over year. “Today Apple is proud to report a June quarter revenue record with double-digit growth in iPhone, Mac and Services and growth around the world, in every geographic segment,” said Tim Cook, Apple’s CEO. “At WWDC25, we were excited to introduce a beautiful new software design that extends across all of our platforms, and we announced even more great Apple Intelligence features.” “We are very pleased with our record business performance for the June quarter, which generated EPS growth of 12 percent,” said Kevan Parekh, Apple’s CFO. “Our installed base of active devices also reached a new all-time high across all product categories and geographic segments, thanks to our very high levels of customer satisfaction and loyalty.” Apple’s board of directors has declared a cash dividend of $0.26 per share of the Company’s common stock. The dividend is payable on August 14, 2025 to shareholders of record as of the close of business on August 11, 2025. Apple will provide live streaming of its Q3 2025 financial results conference call beginning at 2:00 p.m. PT on July 31, 2025, at apple.com/investor/earnings-call. The webcast will be available for replay for approximately two weeks thereafter. Apple periodically provides information for investors on its corporate website, apple.com, and its investor relations website, investor.apple.com. This includes press releases and other information about financial performance, reports filed or furnished with the SEC, information on corporate governance, and details related to its annual meeting of shareholders. This press release contains forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include without limitation those about payment of the Company’s quarterly dividend and future business plans. These statements involve risks and uncertainties, and actual results may differ materially from any future results expressed or implied by the forward-looking statements. Risks and uncertainties include without limitation: effects of global and regional economic conditions, including as a result of government policies, trade and other international disputes, geopolitical tensions, conflict, terrorism, natural disasters, and public health issues; risks relating to the design, manufacture, introduction, and transition of products and services in highly competitive and rapidly changing markets, including from reliance on third parties for components, technology, manufacturing, applications, support, and content; risks relating to information technology system failures, network disruptions, and failure to protect, loss of, or unauthorized access to, or release of, data; and effects of unfavorable legal proceedings, government investigations, and complex and changing laws and regulations. More information on these risks and other potential factors that could affect the Company’s business, reputation, results of operations, financial condition, and stock price is included in the Company’s filings with the SEC, including in the “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” sections of the Company’s most recently filed periodic reports on Form 10-K and Form 10-Q and subsequent filings. The Company assumes no obligation to update any forward-looking statements, which speak only as of the date they are made. Apple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, AirPods, Apple Watch, and Apple Vision Pro. Apple’s six software platforms — iOS, iPadOS, macOS, watchOS, visionOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, iCloud, and Apple TV+. Apple’s more than 150,000 employees are dedicated to making the best products on earth and to leaving the world better than we found it. Press Contact: Josh Rosenstock Apple jrosenstock@apple.com (408) 862-1142 Investor Relations Contact: Suhasini Chandramouli Apple suhasini@apple.com (408) 974-3123 NOTE TO EDITORS: For additional information visit Apple Newsroom (www.apple.com/newsroom), or email Apple’s Media Helpline at media.help@apple.com. © 2025 Apple Inc. All rights reserved. Apple and the Apple logo are trademarks of Apple. Other company and product names may be trademarks of their respective owners. Apple Inc. CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (Unaudited) (In millions, except number of shares, which are reflected in thousands, and per-share amounts) Three Months Ended Nine Months Ended June 28, June 29, June 28, June 29, 2025 2024 2025 2024 Net sales: Products $ 66,613 $ 61,564 $ 233,287 $ 224,908 Services 27,423 24,213 80,408 71,197 Total net sales (1) 94,036 85,777 313,695 296,105 Cost of sales: Products 43,620 39,803 147,097 140,667 Services 6,698 6,296 19,738 18,634 Total cost of sales 50,318 46,099 166,835 159,301 Gross margin 43,718 39,678 146,860 136,804 Operating expenses: Research and development 8,866 8,006 25,684 23,605 Selling, general and administrative 6,650 6,320 20,553 19,574 Total operating expenses 15,516 14,326 46,237 43,179 Operating income 28,202 25,352 100,623 93,625 Other income/(expense), net (171) 142 (698) 250 Income before provision for income taxes 28,031 25,494 99,925 93,875 Provision for income taxes 4,597 4,046 15,381 14,875 Net income $ 23,434 $ 21,448 $ 84,544 $ 79,000 Earnings per share: Basic $ 1.57 $ 1.40 $ 5.64 $ 5.13 Diluted $ 1.57 $ 1.40 $ 5.62 $ 5.11 Shares used in computing earnings per share: Basic 14,902,886 15,287,521 14,992,898 15,401,047 Diluted 14,948,179 15,348,175 15,051,726 15,463,175 (1) Net sales by reportable segment: Americas $ 41,198 $ 37,678 $ 134,161 $ 125,381 Europe 24,014 21,884 82,329 76,404 Greater China 15,369 14,728 49,884 51,919 Japan 5,782 5,097 22,067 19,126 Rest of Asia Pacific 7,673 6,390 25,254 23,275 Total net sales $ 94,036 $ 85,777 $ 313,695 $ 296,105 (1) Net sales by category: iPhone $ 44,582 $ 39,296 $ 160,561 $ 154,961 Mac 8,046 7,009 24,982 22,240 iPad 6,581 7,162 21,071 19,744 Wearables, Home and Accessories 7,404 8,097 26,673 27,963 Services 27,423 24,213 80,408 71,197 Total net sales $ 94,036 $ 85,777 $ 313,695 $ 296,105 Apple Inc. CONDENSED CONSOLIDATED BALANCE SHEETS (Unaudited) (In millions, except number of shares, which are reflected in thousands, and par value) June 28, September 28, 2025 2024 ASSETS: Current assets: Cash and cash equivalents $ 36,269 $ 29,943 Marketable securities 19,103 35,228 Accounts receivable, net 27,557 33,410 Vendor non-trade receivables 19,278 32,833 Inventories 5,925 7,286 Other current assets 14,359 14,287 Total current assets 122,491 152,987 Non-current assets: Marketable securities 77,614 91,479 Property, plant and equipment, net 48,508 45,680 Other non-current assets 82,882 74,834 Total non-current assets 209,004 211,993 Total assets $ 331,495 $ 364,980 LIABILITIES AND SHAREHOLDERS’ EQUITY: Current liabilities: Accounts payable $ 50,374 $ 68,960 Other current liabilities 62,499 78,304 Deferred revenue 8,979 8,249 Commercial paper 9,923 9,967 Term debt 9,345 10,912 Total current liabilities 141,120 176,392 Non-current liabilities: Term debt 82,430 85,750 Other non-current liabilities 42,115 45,888 Total non-current liabilities 124,545 131,638 Total liabilities 265,665 308,030 Commitments and contingencies Shareholders’ equity: Common stock and additional paid-in capital, $0.00001 par value: 50,400,000 shares authorized; 14,856,722 and 15,116,786 shares issued and outstanding, respectively 89,806 83,276 Accumulated deficit (17,607) (19,154) Accumulated other comprehensive loss (6,369) (7,172) Total shareholders’ equity 65,830 56,950 Total liabilities and shareholders’ equity $ 331,495 $ 364,980 Apple Inc. CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (Unaudited) (In millions) Nine Months Ended June 28, June 29, 2025 2024 Cash, cash equivalents, and restricted cash and cash equivalents, beginning balances $ 29,943 $ 30,737 Operating activities: Net income 84,544 79,000 Adjustments to reconcile net income to cash generated by operating activities: Depreciation and amortization 8,571 8,534 Share-based compensation expense 9,680 8,830 Other (1,748) (1,964) Changes in operating assets and liabilities: Accounts receivable, net 5,685 6,697 Vendor non-trade receivables 13,555 11,100 Inventories 1,223 41 Other current and non-current assets (6,116) (5,626) Accounts payable (18,479) (15,171) Other current and non-current liabilities (15,161) 2 Cash generated by operating activities 81,754 91,443 Investing activities: Purchases of marketable securities (17,591) (38,074) Proceeds from maturities of marketable securities 35,036 39,838 Proceeds from sales of marketable securities 10,785 7,382 Payments for acquisition of property, plant and equipment (9,473) (6,539) Other (975) (1,117) Cash generated by investing activities 17,782 1,490 Financing activities: Payments for taxes related to net share settlement of equity awards (5,719) (5,163) Payments for dividends and dividend equivalents (11,559) (11,430) Repurchases of common stock (70,579) (69,866) Proceeds from issuance of term debt, net 4,481 — Repayments of term debt (9,682) (7,400) Repayments of commercial paper, net (65) (2,985) Other (87) (191) Cash used in financing activities (93,210) (97,035) Increase/(Decrease) in cash, cash equivalents, and restricted cash and cash equivalents 6,326 (4,102) Cash, cash equivalents, and restricted cash and cash equivalents, ending balances $ 36,269 $ 26,635 Supplemental cash flow disclosure: Cash paid for income taxes, net $ 37,332 $ 19,230", "id": "0000320193-25-000071_EX-EX-99.1", "exhibit_number": "EX-99.1"}]}}